In [29]:
import pandas as pd
from numpy.random import randn

In [30]:
df = pd.DataFrame(randn(5, 4), index=["A", "B", "C", "D", "E"], columns="W X Y Z".split())

In [31]:
df

          W         X         Y         Z
A  0.311791 -0.456729 -0.022376  0.729268
B -0.288827  0.834856  1.606461 -1.942796
C  1.101441  0.697027 -1.659385  1.415905
D  0.656338 -1.858171 -0.990765  0.918325
E -0.145454  1.874771  0.423930 -0.619961

In [32]:
df["W"]

A    0.311791
B   -0.288827
C    1.101441
D    0.656338
E   -0.145454
Name: W, dtype: float64

In [33]:
df[["W"]]

          W
A  0.311791
B -0.288827
C  1.101441
D  0.656338
E -0.145454

In [34]:
df["new"] = df["W"]

In [35]:
df["new"]

A    0.311791
B   -0.288827
C    1.101441
D    0.656338
E   -0.145454
Name: new, dtype: float64

In [36]:
df

          W         X         Y         Z       new
A  0.311791 -0.456729 -0.022376  0.729268  0.311791
B -0.288827  0.834856  1.606461 -1.942796 -0.288827
C  1.101441  0.697027 -1.659385  1.415905  1.101441
D  0.656338 -1.858171 -0.990765  0.918325  0.656338
E -0.145454  1.874771  0.423930 -0.619961 -0.145454

In [37]:
df["new"] = df["W"] + df["Y"]

In [38]:
df

          W         X         Y         Z       new
A  0.311791 -0.456729 -0.022376  0.729268  0.289415
B -0.288827  0.834856  1.606461 -1.942796  1.317633
C  1.101441  0.697027 -1.659385  1.415905 -0.557945
D  0.656338 -1.858171 -0.990765  0.918325 -0.334427
E -0.145454  1.874771  0.423930 -0.619961  0.278476

In [39]:
df.drop("new", axis = 1)

          W         X         Y         Z
A  0.311791 -0.456729 -0.022376  0.729268
B -0.288827  0.834856  1.606461 -1.942796
C  1.101441  0.697027 -1.659385  1.415905
D  0.656338 -1.858171 -0.990765  0.918325
E -0.145454  1.874771  0.423930 -0.619961

In [40]:
df

          W         X         Y         Z       new
A  0.311791 -0.456729 -0.022376  0.729268  0.289415
B -0.288827  0.834856  1.606461 -1.942796  1.317633
C  1.101441  0.697027 -1.659385  1.415905 -0.557945
D  0.656338 -1.858171 -0.990765  0.918325 -0.334427
E -0.145454  1.874771  0.423930 -0.619961  0.278476

In [41]:
df2 = df.drop("new", axis = 1)

In [42]:
df2

          W         X         Y         Z
A  0.311791 -0.456729 -0.022376  0.729268
B -0.288827  0.834856  1.606461 -1.942796
C  1.101441  0.697027 -1.659385  1.415905
D  0.656338 -1.858171 -0.990765  0.918325
E -0.145454  1.874771  0.423930 -0.619961

In [43]:
df.drop("new", axis = 1, inplace = True)

In [44]:
df

          W         X         Y         Z
A  0.311791 -0.456729 -0.022376  0.729268
B -0.288827  0.834856  1.606461 -1.942796
C  1.101441  0.697027 -1.659385  1.415905
D  0.656338 -1.858171 -0.990765  0.918325
E -0.145454  1.874771  0.423930 -0.619961

In [47]:
df.loc["A"]

W    0.311791
X   -0.456729
Y   -0.022376
Z    0.729268
Name: A, dtype: float64

In [48]:
df.loc[["A", "B"]]

          W         X         Y         Z
A  0.311791 -0.456729 -0.022376  0.729268
B -0.288827  0.834856  1.606461 -1.942796

In [49]:
df.iloc[0, 2]

-0.022375979000968705